Repository: PPereaC/MiPorfolio
Catalog: lib/l10n/intl_*.arb
Languages: es

# availableToWork
source: Available
es: Disponible

# occupation
source: Software Developer
es: Desarrollador de Software

# introduction_como
source: As a
es: Como

# introduction_desarrollador
source: software developer
es: desarrollador de software

# introduction_pasion
source: my passion is to create
es: mi pasión es crear

# introduction_aplicaciones
source: innovative applications
es: aplicaciones innovadoras

# introduction_diferencia
source: that make a difference. My experience in
es: que marquen la diferencia. Mi experiencia en

# introduction_multiplataforma
source: cross-platform development
es: desarrollo multiplataforma

# introduction_soluciones
source: allows me to create complete solutions. I am a
es: me permite crear soluciones completas. Soy una persona

# introduction_curiosa
source: curious and proactive person,
es: curiosa y proactiva,

# introduction_buscando
source: always looking for
es: siempre buscando

# introduction_desafios
source: new challenges
es: nuevos desafíos

# introduction_creciendo
source: that allow me to continue growing in the world of development.
es: que me permitan seguir creciendo en el mundo del desarrollo.

# toggleToDarkMode
source: Switch to dark mode
es: Cambiar a tema oscuro

# toggleToLightMode
source: Switch to light mode
es: Cambiar a tema claro

# homeSection
source: Home
es: Inicio

# projectsSection
source: Projects
es: Proyectos

# experienceSection
source: Experience
es: Experiencia

# technologiesSection
source: Technologies
es: Tecnologías

# trainingSection
source: Training
es: Formación

# projectsSectionLabelP1
source: My
es: Mis

# projectsSectionLabelP2
source: projects
es: proyectos

# projectsSectionDescription
source: Here you can see some of the projects I have worked on
es: Estos son algunos de los proyectos en los que he trabajado

# experienceSectionLabelP1
source: My
es: Experiencia

# experienceSectionLabelP2
source: experience
es: laboral

# experienceSectionDescription
source: Here you can see my work experience
es: Estas son las empresas en las que he trabajado

# jobSupermarketDescription
source: I developed a desktop application in Flutter for product management, generating labels with barcodes, name, quantity, price, and price per KG/L to optimize organization and sales in the supermarket.
es: Desarrollé una aplicación de escritorio en Flutter para la gestión de productos, generando etiquetas con códigos de barras, nombre, cantidad, precio, y precio por KG/L para optimizar la organización y venta en el supermercado.

# jobVicenteNavasDescription
source: I developed a Flutter application for employees, allowing them to manage and view chiller information, with QR scanning for physical machine data.
es: Desarrollé una aplicación en Flutter para empleados, permitiendo gestionar y ver información de enfriadoras, con escaneo de QR para datos de máquinas físicas.

# jobDeltanetDescription
source: During the three months of internship, I developed cross-platform applications with Flutter and participated in a web project using PHP/Laravel. I implemented custom solutions and worked with RESTful APIs, covering both frontend and backend.
es: Durante los tres meses de prácticas, desarrollé aplicaciones multiplataforma con Flutter y participé en un proyecto web usando PHP/Laravel. Implementé soluciones personalizadas y trabajé con APIs RESTful, abarcando tanto frontend como backend.

# skillsSectionLabelP1
source: My
es: Mis

# skillsSectionLabelP2
source: skills
es: habilidades

# skillsSectionDescription
source: Technologies, languages, frameworks, tools and databases that I have worked with
es: Tecnologías, lenguajes y herramientas que utilizo o he utilizado

# skillsLanguagesTitle
source: Languages
es: Lenguajes

# skillsToolsTitle
source: Tools
es: Herramientas

# skillsDatabasesTitle
source: Databases
es: Bases de Datos

# trainingSectionLabelP1
source: My
es: Mi

# trainingSectionLabelP2
source: training
es: formación

# trainingSectionDescription
source: Here you can see my training and certifications
es: Esta es mi formación académica y profesional

# projectCineradarDescription
source: Discover movies and save your favorites in your own personalized collection.
es: Descubre películas y guarda tus favoritas en tu propia colección personalizada.

# projectFinmusicDescription
source: Cross-platform YouTube Music player. Search and play any song or music video for free.
es: Reproductor multiplataforma de música de YouTube Music. Busca y reproduce cualquier canción o video musical de forma gratuita.

# projectPortfolioDescription
source: Personal portfolio showcasing my projects, skills and development experience.
es: Portfolio personal mostrando mis proyectos, habilidades y experiencia en desarrollo.

# projectViewButton
source: View project
es: Ver proyecto

# footerRightsReserved
source: Almost all rights reserved
es: Casi todos los derechos reservados

source: Made with Flutter
es: Hecho con Flutter
